In [10]:
# Assignment 2
import pandas as pd

# Create the DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana', 'Eve'],
    'Age': [24, 27, 22, 32, 29],
    'Department': ['HR', 'Finance', 'IT', 'Marketing', 'HR'],
    'Salary': [45000, 54000, 50000, 62000, 47000]
}
df = pd.DataFrame(data)
df

      Name  Age Department  Salary
0    Alice   24         HR   45000
1      Bob   27    Finance   54000
2  Charlie   22         IT   50000
3    Diana   32  Marketing   62000
4      Eve   29         HR   47000

In [12]:
# a. Print the first five rows
print("First five rows:")
print(df)

# b. Summary statistics for 'Age' and 'Salary'
print("\nSummary statistics:")
print(df[['Age', 'Salary']].describe())

# c. Average salary in 'HR' department
avg_hr_salary = df[df['Department'] == 'HR']['Salary'].mean()
print("\nAverage salary in HR department:", avg_hr_salary)

First five rows:
      Name  Age Department  Salary
0    Alice   24         HR   45000
1      Bob   27    Finance   54000
2  Charlie   22         IT   50000
3    Diana   32  Marketing   62000
4      Eve   29         HR   47000

Summary statistics:
             Age        Salary
count   5.000000      5.000000
mean   26.800000  51600.000000
std     3.962323   6730.527468
min    22.000000  45000.000000
25%    24.000000  47000.000000
50%    27.000000  50000.000000
75%    29.000000  54000.000000
max    32.000000  62000.000000

Average salary in HR department: 46000.0

In [14]:
# Add a new column 'Bonus' (10% of Salary)
df['Bonus'] = df['Salary'] * 0.10
print("\nDataFrame with 'Bonus' column:")
print(df)

DataFrame with 'Bonus' column:
      Name  Age Department  Salary   Bonus
0    Alice   24         HR   45000  4500.0
1      Bob   27    Finance   54000  5400.0
2  Charlie   22         IT   50000  5000.0
3    Diana   32  Marketing   62000  6200.0
4      Eve   29         HR   47000  4700.0

In [16]:
# Group by 'Department' and calculate average salary
dept_avg_salary = df.groupby('Department')['Salary'].mean()
print("\nAverage salary by department:")
print(dept_avg_salary)

Average salary by department:
Department
Finance      54000.0
HR           46000.0
IT           50000.0
Marketing    62000.0
Name: Salary, dtype: float64

In [18]:
# Sort by 'Salary' in ascending order
sorted_df = df.sort_values(by='Salary', ascending=True)

# Save the sorted DataFrame to a CSV file
sorted_df.to_csv('sorted_employees.csv', index=False)
print("\nSorted DataFrame by 'Salary' saved to 'sorted_employees.csv':")
print(sorted_df)

Sorted DataFrame by 'Salary' saved to 'sorted_employees.csv':
      Name  Age Department  Salary   Bonus
0    Alice   24         HR   45000  4500.0
4      Eve   29         HR   47000  4700.0
2  Charlie   22         IT   50000  5000.0
1      Bob   27    Finance   54000  5400.0
3    Diana   32  Marketing   62000  6200.0